kepler-444b/GD32E225/Source/plcp_device/APP_UserProcess.c
/********************************************************************************
 * (c) Copyright 2017-2020, LME, All Rights Reserved锟斤拷
 * THIS IS UNPUBLISHED PROPRIETARY SOURCE CODE OF LME, INC锟斤拷
 * The copyright notice above does not evidence any actual or intended
 * publication of such source code
 *
 * FileName    : APP_UserProcess.h
 * Author      :
 * Date        : 2024-09-06
 * Version     : 1.0
 * Description : 用户实现功能填写内容
 *             :
 * Others      :
 * ModifyRecord:
 *
 ********************************************************************************/
#include "../../Source/device/device_manager.h"
#if defined PLCP_DEVICE
#include "../../Source./plcp_device/plcp_panel/attr_table.h"
#include "../../Source/base/base.h"
#include "../../Source/base/debug.h"
#include "../../Source/plcp_device/MseProcess.h"
#include "../../Source/plcp_device/plcp_linght_ct/light_ct_attr_table.h"
#include "../../Source/plcp_device/plcp_linght_ct/plcp_light_ct_info.h"
#include "../../Source/plcp_device/plcp_panel/panel_adapter.h"
#include "../../Source/plcp_device/plcp_user_api/PLCP_callback.h"
#include "../../Source/plcp_device/plcp_user_api/PLCP_special_scene.h"
#include "../../Source/usart/usart.h"
#include "APP_PublicAttribute.h"
#include "gd32e23x.h"
#include "systick.h"

/**********************************函数列表  开始************************************
 * 1、   void MCU_Load_Product(void)                   MCU给plc模组写入产品信息
 * 2、   void MCU_Load_AEInfo(void)                    MCU给plc模组写入AE信息
 * 3、   void MCU_Enable_Transmission(void)            MCU使能plc模组透传功能
 * 4、   void APP_PLCSDK_Init(void)                    sdk内部需要初始化的内容
 * 5、   void MCU_Control_Open(void)                   MCU实现开机功能——"/_on"服务项
 * 6、   void MCU_Control_Close(void)                  MCU实现关机功能——"/_off"服务项
 * 7、   void MCU_Control_Set_Temperature(uint8_t *buf, uint8_t len)       MCU实现设置温度的功能——"/_state"服务项
 * 8、   void MCU_Control_Set_Mode(uint8_t *buf, uint8_t len)      MCU实现设置模式的功能——"/_config"服务项
 * 9、      void MCU_Control_Set_Windspeed(uint8_t value)       MCU实现设置风速的功能
 * 10、void MCU_Set_Config(uint8_t *buf, uint8_t len)             MCU实现设置属性
 * 11、   uint16_t MCU_Scene_exe(uint8_t *buf)                     MCU启动场景功能
 * 12、  void MCU_Device_Factory(void)                 MCU实现恢复出厂设置功能——"/_factory"服务项
 * 13、  void MCU_Device_ResetService(uint8_t *buf, uint8_t len)      MCU实现复位功能——"/_rst"服务项
 * 14、  void MCU_deviceOnorOutline(uint8_t value)               MCU获取是否入网状态
 * 15、  void MCU_Proactively_report(void)                  MCU实现主动上报功能
 * 16、  uint8_t MCU_UartReceive(uint8_t *recbuf, uint16_t reclen)         MCU串口接收缓存，添加到接收队列
 * 17、  void MCU_Send_date(uint8_t *SendBuff, uint16_t SendBuffLen)  MCU串口发送缓存，添加到发送队列
 * 18、  void APP_Queue_ListenAndHandleMessage(void)        MCU APP层消息的监听（接收队列、发送队列）和处理函数
 ***********************************函数列表  结束***********************************/

/************************************移植须知:******************************************
                                第一步:初始化
1：上电之后，mcu需要分别给plc模组写入产品信息、ae信息、使能透传功能。（最好是mcu上电3-5s后才开始写入）
    i:   调用MCU_Load_Product();写入产品信息
    ii:  MCU_Load_AEInfo();写入ae信息
    iii: MCU_Enable_Transmission();使能透传功能
    为了防止反复写plc模组flas，在mcu首次上电写入成功后需要将成功标志保存，后续上下电判断该标志判定是否需要重新写入
2: mcu上电需要周期性轮询plc模组的did——did不为0说明已入网，反之；若
3：场景，群组信息等需要掉电保持的信息，上电需要初始化读取
                                第二步:实现功能
1: 对照协议内容与实际需求，将需要实现的服务项功能对照函数列表分别填写
2: 产品信息与AE信息需要用户重新填写的部分，用户可根据实际自行修改宏定义
4: 设备接收和发送需要调用MCU_UartReceive()，MCU_Send_date()添加到消息队列中
5: 单片机进入while循环后调用APP_Queue_ListenAndHandleMessage()函数对消息进行监听，有新消息则处理
                                第三步：存储数据
根据单片机实际的读、写flash函数改写sdk中的例子
1：APP_PublicAttribute.c文件中的APP_SavePostFlag()、APP_ReadPostFlag()需要实现读，写flash操作
2：Scene_demo.c文件中的APP_SaveSceneParameter()、APP_SaveGroupParameter()、APP_ReadParameter()需要实现读写flash操作
3：APP_PublicAttribute.h文件内的FLASH_WRITE_POSTWRIET_FLAG以及Scene_demo.h文件内的FLASH_GROUP_INFO_START_ADD、FLASH_SCENE_INFO_START_ADD存储的地址需要重新规划
******************************************************************************/
#define CompanyName "AODSN"
#define product_model "panel_td_4key"
#define PID "991018"

#define BrandName "6键"
#define id "AODSN_panel_switch"
#define url "https://wowoja.cn/oss/panel/lme/AODSN_panel_switch/v1.0/index.html"

// #define AE_NUM_SIZE   1
// #define AE_NUM_VALUES {"1,2,3,4,5,6"}

#define AE_NUM_SIZE 1
#define AE_NUM_VALUES {"11"}
const char *ae_num[AE_NUM_SIZE] = AE_NUM_VALUES;

void PLCP_Load_Product(char *product);
void PLCP_Load_McuVer(char *product);

void MCU_Load_Product(void)
{
    PLCP_Load_Product(PLCP_Callback_Product());
}

void PLCP_Load_AEInfo(char *root);
void MCU_Load_AEInfo(void)
{
    // CmdTest_MSE_Load_AEInfo(ae_num, AE_NUM_SIZE, BrandName, id, url);
    PLCP_Load_AEInfo(PLCP_Callback_Ae());
    // PLCP_Load_AEInfo(ae_srt);
}

// char widgets_srt[] =
//     "{\"widgets\":["
//     "{"
//     "\"name\":\"Switch\","
//     "\"ae\":[\"k1\",\"k2\",\"k3\",\"k4\",\"k5\",\"k6\"],"
//     "\"se\":\"1\","
//     "\"type\":\"switch\","
//     "\"events\":["
//     "{"
//     "\"id\":\"_open\","
//     "\"name\":\"OFF\","
//     "\"data\":\"0\""
//     "},"
//     "{"
//     "\"id\":\"_close\","
//     "\"name\":\"ON\","
//     "\"data\":\"1\""
//     "}"
//     "]"
//     "}"
//     "]}";
void PLCP_Load_Widgets(char *root);
void MCU_Load_Widgets(void)
{
    PLCP_Load_Widgets(PLCP_Callback_Widgets());
}

/*************************************************s****************************
函数名称 : MCU_Enable_Transmission
功能描述 : MCU使能plc模组透传功能
输入参数 : 无
返回参数 : 无
使用说明 : 使能后plc模组才能把恢复出厂命令以及复位命令透传到mcu模组；只要写成功一次即可（需要避免重复写入）
*****************************************************************************/
void CmdTest_MSE_SET_Transfer(void); // 向前声明
void MCU_Enable_Transmission(void)
{
    CmdTest_MSE_SET_Transfer();
}

/*****************************************************************************
函数名称 : APP_PLCSDK_Init
功能描述 : PLC sdk需要初始化的内容
输入参数 : 无
返回参数 : 无
使用说明 : sdk实现进行初始化的功能
*****************************************************************************/
void APP_PLCSDK_Init(void)
{
    APP_TxBuffer_init();
    APP_RxBuffer_init();
    // APP_GroupClr();
    // APP_SceneClr();

    APP_ReadBindParameter(); // 读取绑定信息
    // APP_Bindinit();          // Bind 订阅事件总线
    // APP_SceneInit();

    APP_ReadDelaySceneParameter(); // 读取延时场景信息
    APP_ReadNightSceneParameter(); // 读取夜灯场景信息

    APP_ReadRecordFlag_Init(); // 初始化入网标志位
    APP_ReadAllSceneInfo();    // 读取所有场景信息
    APP_ReadAllGroupInfo();    // 读取所有群组信息

#if defined PLCP_LIGHT_CT
    APP_Read_light_ct_info();
#endif
}

/*****************************************************************************
函数名称 : MCU_Control_Open
功能描述 : MCU实现开机的功能
输入参数 : 无
返回参数 : 无
使用说明 : 在此实现设备开机的功能
*****************************************************************************/
uint8_t MCU_Control_Open(void)
{
    printf("**MCU_Control_Open**\n");
    return 0;
}

/*****************************************************************************
函数名称 : MCU_Control_Close
功能描述 : MCU实现关机的功能
输入参数 : 无
返回参数 : 无
使用说明 : 在此实现设备关机的功能
*****************************************************************************/
uint8_t MCU_Control_Close(void)
{
    printf("**MCU_Control_Close**\n");
    return 0;
}

/*****************************************************************************
函数名称 : MCU_Control_Set_Temperature
功能描述 : MCU实现设置温度的功能
输入参数 : value：温度数据-2byte, uint8_t len
返回参数 : 无
使用说明 : 在此实现设备设置温度的功能(上位机下发的温度数据已放大10倍，本地处理需还原)
*****************************************************************************/
uint8_t MCU_Control_Set_Temperature(uint8_t *value, uint8_t len)
{
    printf("**MCU_Control_Set_Temperature**\n");
    return 0;
}

/*****************************************************************************
函数名称 : MCU_Control_Set_Mode
功能描述 : MCU实现设置模式的功能
输入参数 : value-模式值（含义参考协议）
返回参数 : 无
使用说明 : 在此实现设置模式的功能
*****************************************************************************/
uint8_t MCU_Control_Set_Mode(uint8_t value)
{
    printf("**MCU_Control_Set_Mode**\n");
    return 0;
}

/*****************************************************************************
函数名称 : MCU_Control_Set_Windspeed
功能描述 : MCU实现设置风速的功能
输入参数 : value-风速值（含义参考协议）
返回参数 : 无
使用说明 : 在此实现设备设置风速的功能
*****************************************************************************/
uint8_t MCU_Control_Set_Windspeed(uint8_t value)
{
    printf("**MCU_Control_Set_Windspeed**\n");
    return 0;
}

//  设置属性
uint8_t MCU_Set_Config(uint8_t *buf, uint8_t buf_len)
{
    APP_PRINTF_BUF("MCU_Set_Config", buf, buf_len);
    uint8_t cmd_type = buf[0];
    uint16_t ctrl_bits = (buf[1] << 8) | buf[2];
    uint8_t idx = 0;

    switch (cmd_type) {
    // 需要逐位处理的类型
    case KJ_MODE: {
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            if (ctrl_bits & (1 << (15 - i))) {
                uint8_t status = buf[3 + idx];
                attr_kj_mode_table_set(i, status);
                idx++;
            }
        }
    } break;

    case SCENE_LINK: {
        special_scene_set(buf, buf_len);
    } break;
    case RELAY_POWER_UP: {
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            if (ctrl_bits & (1 << (15 - i))) {
                uint8_t status = buf[3 + idx];
                attr_relay_power_up_table_set(i, status);
                idx++;
            }
        }
    } break;

