kepler-444b/GD32E225/Source/plcp_device/APP_UserProcess.c
    case REPORT_TYPE: {
        bool rpt = BIT15(ctrl_bits);
        bool order = BIT14(ctrl_bits);

        report *temp = attr_report_type_get();

        if (rpt && !order) { // 只设置rpt
            temp->rpt = buf[3];
        }
        if (!rpt && order) { // 只设置order
            temp->order = buf[3];
        }
        if (rpt && order) { // 都设置
            temp->rpt = buf[3];
            temp->order = buf[4];
        }
        attr_report_type_set(temp); // 保存到flash

        attr_report_type_get(); // 设置完成后,读到全局静态变量
    } break;
    default:
        return 0;
    }

    return 1;
}

uint8_t MCU_Get_Config(uint8_t *buf, uint8_t type, uint16_t bits)
{
    APP_PRINTF("MCU_Get_Config\n");
    uint8_t count = 0;
    buf[count++] = type;
    buf[count++] = (bits >> 8) & 0xFF;
    buf[count++] = bits & 0xFF;

    switch (type) {
    case KJ_MODE: {
        for (uint8_t i = 0; i < 16; i++) {
            if (BIT_HIGH_TO_LOW(bits, i)) {
                buf[count++] = attr_kj_mode_table_get(i);
            }
        }
        return count;
    } break;

    case SCENE_LINK: {

        if ((bits >> 15) & 0x01) { // 延时
            DelayScene_t *obj = special_delay_scene_get();
            buf[count++] = obj->enable;
            buf[count++] = (uint8_t)(obj->scene_id & 0xFF);
            buf[count++] = (uint8_t)(obj->scene_id >> 8);
            buf[count++] = (uint8_t)(obj->scene_timer & 0xFF);
            buf[count++] = (uint8_t)(obj->scene_timer >> 8);
        }
        if ((bits >> 14) & 0x01) { // 夜灯
            NightScene_t *obj = special_night_scene_get();
            buf[count++] = obj->night_enable;
            buf[count++] = (uint8_t)(obj->open_night & 0xFF);
            buf[count++] = (uint8_t)(obj->open_night >> 8);
            buf[count++] = (uint8_t)(obj->close_night & 0xFF);
            buf[count++] = (uint8_t)(obj->close_night >> 8);
        }

        return count;
    } break;
    case RELAY_POWER_UP: {
        for (uint8_t i = 0; i < 16; i++) {
            if (BIT_HIGH_TO_LOW(bits, i)) {
                buf[count++] = attr_relay_power_up_table_get(i);
            }
        }
        return count;
    } break;
    // case KEY_NUM: {
    //     buf[count++] = attr_key_num_get();
    //     return count;
    // } break;
    case REPORT_TYPE: {
        report *p_report = NULL;
        p_report = attr_report_type_get();

        if (BIT15(bits) && !BIT14(bits)) {
            buf[count++] = p_report->rpt;
            return count;
        }
        if (!BIT15(bits) && BIT14(bits)) {
            buf[count++] = p_report->order;
            return count;
        }
        if (BIT15(bits) && BIT14(bits)) {
            buf[count++] = p_report->rpt;
            buf[count++] = p_report->order;
            return count;
        }
    } break;
    case NULL_TYPE_CONFIG: {

        count = 0;
        // 按键类型
        buf[count++] = KJ_MODE;
        buf[count++] = (uint8_t)(0xFF << (8 - KEY_NUMBER));
        buf[count++] = 0x00;
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            buf[count++] = attr_kj_mode_table_get(i);
        }

        // 场景联动属性
        buf[count++] = SCENE_LINK;
        buf[count++] = 0xC0;
        buf[count++] = 0x00;

        DelayScene_t *temp = special_delay_scene_get();
        if (temp == NULL) {
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
        } else {
            buf[count++] = temp->enable;
            buf[count++] = (uint8_t)(temp->scene_id & 0xFF);
            buf[count++] = (uint8_t)(temp->scene_id >> 8);
            buf[count++] = (uint8_t)(temp->scene_timer & 0xFF);
            buf[count++] = (uint8_t)(temp->scene_timer >> 8);
        }

        NightScene_t *obj = special_night_scene_get();
        if (obj == NULL) {
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
            buf[count++] = 0x00;
        } else {
            buf[count++] = obj->night_enable;
            buf[count++] = (uint8_t)(obj->open_night & 0xFF);
            buf[count++] = (uint8_t)(obj->open_night >> 8);
            buf[count++] = (uint8_t)(obj->close_night & 0xFF);
            buf[count++] = (uint8_t)(obj->close_night >> 8);
        }

        // 上报方式
        buf[count++] = REPORT_TYPE;
        report *p_report = NULL;
        p_report = attr_report_type_get();
        if (BIT15(bits) && !BIT14(bits)) {
            buf[count++] = p_report->rpt;
        }
        if (!BIT15(bits) && BIT14(bits)) {
            buf[count++] = p_report->order;
        }
        if (BIT15(bits) && BIT14(bits)) {
            buf[count++] = p_report->rpt;
            buf[count++] = p_report->order;
        }

        return count;
        break;
    }
    default:
        break;
    }
    return 0;
}

// 执行默认场景
void MCU_Scene_exe(uint8_t *buf, uint8_t buf_len)
{
#if defined PLCP_PANEL
    parse_control_commands(buf, buf_len);
#elif defined PLCP_LIGHT_CT
    light_ct_ctrl(&buf[1], buf_len);
#endif
}

// 执行控件场景
void MCU_SceneKj_exe(uint8_t *buf, uint8_t kj_index, uint8_t kj_type)
{
    if (buf[0] != 0x01) { // 如果没有 "开场景",直接返回
        return;
    }
    switch (kj_type) {
    case LED_SCENE: // LED 场景
        attr_key_state_table_set(kj_index, buf[1]);
        break;
    case CH_SCENE:
        attr_relay_table_set(kj_index, buf[1]);
        break;
    default:
        return;
    }
}

// 对于清理勿扰,插卡后恢复
void MCU_dnd_recover(void)
{
    //     uint8_t k1_status;
    //     uint8_t k2_status;
    // #if defined PANEL_3KEY

    //     k1_status = attr_led_table_get(2);
    //     k2_status = attr_led_table_get(3);

    //     attr_led_table_set(2, k1_status);
    //     attr_led_table_set(3, k2_status);

    //     // 因为使用 MCU_dnd_recover 跳过了正常的场景执行,对于亚朵3.6的三键竖向面板,卫浴灯在这里做特殊处理
    //     attr_led_table_set(0, true);
    //     attr_key_state_table_set(0, true);
    //     switch_led_b_ctrl(0, 0, 1);

    //     switch_led_b_ctrl(2, k1_status ? 0 : 100, 1);
    //     switch_led_b_ctrl(3, k2_status ? 0 : 100, 1);

    // #elif defined PANEL_4KEY
    //     k1_status = attr_led_table_get(0);
    //     k2_status = attr_led_table_get(1);

    //     attr_led_table_set(0, k1_status);
    //     attr_led_table_set(3, k1_status);

