kepler-444b/GD32E225/Source/plcp_device/APP_UserProcess.c
    //     switch_adapter_led_b_ctrl(0, !k1_status);
    //     switch_adapter_led_b_ctrl(3, !k1_status);

    //     attr_led_table_set(1, k2_status);
    //     attr_led_table_set(2, k2_status);

    //     switch_adapter_led_b_ctrl(1, !k2_status);
    //     switch_adapter_led_b_ctrl(2, !k2_status);
    // #endif
}

void MCU_Group_State(uint8_t *buf, uint8_t buf_len)
{
    light_ct_ctrl(buf, buf_len);
}

void MCU_GroupKj_On(uint8_t status, uint8_t kj_index, uint8_t kj_type)
{
    switch (kj_type) {
    case LED_SCENE:
        break;
    case CH_SCENE:
        attr_relay_table_set(kj_index, status);
        break;
    case SCENE:
        attr_light_ct_table_set(true);
        break;
    default:
        return;
    }
}

void MCU_GroupKj_Off(uint8_t status, uint8_t kj_index, uint8_t kj_type)
{
    switch (kj_type) {
    case LED_SCENE:
        break;
    case CH_SCENE:
        attr_relay_table_set(kj_index, status);
        break;
    case SCENE:
        attr_light_ct_table_set(status);
        break;
    default:
        return;
    }
}
/*****************************************************************************
函数名称 : MCU_Device_Factory
功能描述 : MCU恢复出厂设置功能
输入参数 : 无
返回参数 : 无
使用说明 : 在此实现设备恢复出厂设置(包括清除群组、场景、写信息成功标志位以及设备本地相关需要清除的数据)
*****************************************************************************/
void MCU_Device_Factory(void)
{
    printf("MCU_Device_Factory\n");

    delay_1ms(100);

    // 恢复出厂设置闪烁
    for (uint8_t cycle = 0; cycle < 2; cycle++) {
        // 全部亮
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            switch_led_ctrl(i, true);
        }
        delay_1ms(500);

        // 全部灭
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            switch_led_ctrl(i, false);
        }
        delay_1ms(500);
    }

    CmdTest_MSE_Factory();      // 模组恢复出厂设置
    APP_Attribute_Init();       // 清空联网状态
    APP_SceneGroupClr();        // 清空场景与群组
    PLCP_bindTableClr();        // 清空绑定信息
    APP_SpecialSceneClr();      // 清空特殊场景
    attr_kj_mode_table_reset(); // 按键类型恢复默认

    NVIC_SystemReset();
}

/*****************************************************************************
函数名称 : MCU_Device_ResetService
功能描述 : MCU复位功能
输入参数 : buf-复位数据（数据结构参考协议），len-数据长度
返回参数 : 无
使用说明 : 在此实现设备复位功能（
*****************************************************************************/
void MCU_Device_ResetService(uint8_t *buf, uint8_t len)
{
    // if (len == 0) {
    //     return;
    // }

    // uint8_t Type = buf[1];
    // for (uint8_t i = 0; i < 8; i++) {
    //     if ((Type >> i) & 0x1) {
    //         switch (i) {
    //             case 2: // 群组初始化
    //                 APP_GroupClr();
    //                 break;
    //             case 3: // 场景初始化
    //                 APP_SceneClr();
    //                 break;
    //         }
    //     }
    // }
    // printf("MCU_Device_ResetService\n");
}

/*****************************************************************************
函数名称 : MCU_deviceOnorOutline
功能描述 : MCU串口接收处理数据函数
输入参数 : value：1-在线；0-不在线
返回参数 : 无
使用说明 : 用户可根据传入值判断设备当前是否在线。
          例如温控面板有入网标示灯，那么本函数的值可以作为判断依据。
*****************************************************************************/
void MCU_deviceOnorOutline(uint8_t value)
{
    // printf("OnorOutline:%d\n", value);
}

/*****************************************************************************
函数名称 : MCU_Proactively_report
功能描述 : MCU主动上报状态接口
输入参数 : 无
返回参数 : 无
使用说明 : 当MCU本地状态发生改变时需要主动上报状态
*****************************************************************************/
void MCU_Proactively_report(void)
{
    /*********************************示例 开始**************************************** */
    uint8_t data[64];
    uint8_t len = 0;
    // uint16_t temp = get_tempSmp();
    // uint16_t setTemp = get_tempSet_ac();
    const sPublic_attribute *pAttributeOfAPP = NULL;
    pAttributeOfAPP = APP_Attribute_GetPointer();
    uint8_t ccoMacAddr[6];
    uint8_t selfMacAddr[6];
    memcpy(selfMacAddr, pAttributeOfAPP->selfMacAddr, sizeof(selfMacAddr));
    memcpy(ccoMacAddr, pAttributeOfAPP->ccoMacAddr, sizeof(ccoMacAddr));

    data[len++] = 1;
    data[len++] = 0xF0;
    data[len++] = 0x00;
    // data[len++] = get_power_ac();
    // data[len++] = setTemp >> 8;
    // data[len++] = setTemp & 0xFF;
    // data[len++] = temp >> 8;
    // data[len++] = temp & 0xFF;
    // data[len++] = get_ac_mode();
    // data[len++] = get_speedSet_ac();
    /*************************************示例 结束************************************* */

    CmdTest_MSE_POST_Status(ccoMacAddr, selfMacAddr, data, len);
}

/*****************************************************************************
函数名称 : MCU_Get_Devicestatus
功能描述 : 获取MCU设备状态
输入参数 : buf：需要上送的状态数据
返回参数 : 无
使用说明 : 上位机获取设备状态，该函数实现将状态数据按照协议要求进行组帧
*****************************************************************************/

// 获取 state
uint8_t MCU_Get_Devicestatus(uint8_t *buf, uint8_t type, uint16_t bits)
{
#if defined PLCP_PANEL
    uint8_t count = 0;
    buf[count++] = type;
    buf[count++] = (bits >> 8) & 0xFF;
    buf[count++] = bits & 0xFF;

    switch (type) {
    case BUTTON_TYPE: {
        for (uint8_t i = 0; i < 16; i++) {
            if (BIT16_HIGH_TO_LOW(bits, i)) {
                buf[count++] = attr_key_state_table_get(i);
            }
        }
        return count;
    } break;

    case REALY_TYPE: {
        for (uint8_t i = 0; i < 16; i++) {
            if (BIT16_HIGH_TO_LOW(bits, i)) {
                buf[count++] = attr_relay_table_get(i);
            }
        }
        return count;
    } break;

    case BLCK_TYPE: {
        for (uint8_t i = 0; i < 16; i++) {
            if (i < 8) {
                if (BIT16_HIGH_TO_LOW(bits, i)) { // 按键背光灯
                    if (attr_ad_led_b_table_get(i)) {
                        buf[count++] = 0x01;
                    } else {
                        buf[count++] = 0x00;
                    }
                }
            } else {
                if (BIT16_HIGH_TO_LOW(bits, i)) { //  按键指示灯
                    buf[count++] = attr_led_table_get(i - 8);
                }
            }
        }
        return count;
    } break;

    case ADJUST_BLCK_TYPE: {
        for (uint8_t i = 0; i < 16; i++) {
            if (BIT16_HIGH_TO_LOW(bits, i)) {
                buf[count++] = attr_ad_led_b_table_get(i);
            }
        }
        return count;
    } break;

    case NULL_TYPE: {
        count = 0;
        buf[count++] = BUTTON_TYPE;
        buf[count++] = (uint8_t)(0xFF << (8 - KEY_NUMBER));
        buf[count++] = 0x00;

