kepler-444b/GD32E225/Source/plcp_device/APP_UserProcess.c
        for (uint8_t i = 0; i < KEY_NUMBER; i++) { // 按键状态
            buf[count++] = attr_key_state_table_get(i);
        }
        buf[count++] = BLCK_TYPE;
        buf[count++] = (uint8_t)(0xFF << (8 - KEY_NUMBER));
        buf[count++] = (uint8_t)(0xFF << (8 - KEY_NUMBER));

        for (uint8_t i = 0; i < KEY_NUMBER; i++) { // LED 状态
            if (attr_ad_led_b_table_get(i)) {
                buf[count++] = 0x01;
            } else {
                buf[count++] = 0x00;
            }
        }
        for (uint8_t i = 0; i < KEY_NUMBER; i++) {
            buf[count++] = attr_led_table_get(i);
        }

        buf[count++] = ADJUST_BLCK_TYPE;
        buf[count++] = (uint8_t)(0xFF << (8 - KEY_NUMBER));
        buf[count++] = bits & 0x00;
        for (uint8_t i = 0; i < KEY_NUMBER; i++) { // 可调背光状态
            buf[count++] = attr_ad_led_b_table_get(i);
        }
        return count;
    } break;
    default:
        break;
    }

#elif defined PLCP_LIGHT_CT
    buf[0] = 0x30;
    buf[1] = 0x00;
    uint16_t brightness;
    uint16_t color_temp;

    const light_ct_t *obj = get_light_info();
    if (obj->brightness_type) {
        brightness = obj->brightness * 100;
    } else {
        brightness = obj->brightness;
    }
    color_temp = obj->color_temp;
    memcpy(&buf[2], &brightness, sizeof(brightness));
    memcpy(&buf[4], &color_temp, sizeof(color_temp));
    return 6;
#endif
    return 0;
}

// 设置 state
void MCU_Put_Devicestatus(uint8_t *buf, uint8_t buf_len)
{
#if defined PLCP_PANEL
    switch_status_by_bits(buf, buf_len);
#elif defined PLCP_LIGHT_CT
    light_ct_ctrl(buf, buf_len);

#endif
}

/*****************************************************************************
函数名称 : MCU_Get_Ver
功能描述 : 获取MCU固件版本信息数据
输入参数 :
返回参数 : buf：版本数据
使用说明 : 前两个字节-版本号，后四个字节时间日期
*****************************************************************************/
uint8_t MCU_Get_Ver(uint8_t *buf)
{
    uint8_t ver[8] = {0x00, 0x00, 0x00, 0x01, 0x20, 0x26, 0x04, 0x7};

    memcpy(buf, ver, sizeof(ver));
    return sizeof(ver);
}

uint8_t MCU_UartReceive(uint8_t *recbuf, uint16_t reclen)
{
    // APP_PRINTF("MCU_UartReceive\n");
#if 1
    RxDataParametersStruct rxDataParam;
    rxDataParam.rxData = recbuf;
    rxDataParam.rxDataLen = reclen;
    return APP_RxBuffer_Add(&rxDataParam);
#else
    APP_UappsMsgProcessing(recbuf, reclen);
#endif
}

void MCU_Send_date(uint8_t *SendBuff, uint16_t SendBuffLen)
{
#if 1
    APP_DataTxTask txTask;
    txTask.nsdu = SendBuff;
    txTask.nsduLength = SendBuffLen;
    APP_TxBuffer_Add(&txTask);
#else

    app_usart_tx_buf(SendBuff, SendBuffLen, USART0);
#endif
}

void APP_Queue_ListenAndHandleMessage(void)
{
    RxDataParametersStruct rxDataPointer;
    APP_DataTxTask txTask;
    uint16_t rxBufferLeftAmount = 0;
    rxBufferLeftAmount = APP_RxBuffer_getRxBufferMsgAmount();
    // APP_PRINTF("rxBufferLeftAmount:%d\n", rxBufferLeftAmount);
    if (rxBufferLeftAmount > 0) {                                              // 接受队列
        APP_RxBuffer_GetFirstMsgDataParameters(&rxDataPointer);                // 读取第一条数据
        APP_UappsMsgProcessing(rxDataPointer.rxData, rxDataPointer.rxDataLen); // 处理读取的数据
        APP_RxBuffer_DeleteFirstMsg();                                         // 删除已经处理的数据
    }
    if (APP_TxBuffer_GetFirstMsgDataParameters(&txTask)) { // 检查队列是否 有需要发送的数据
        app_usart_tx_buf(txTask.nsdu, txTask.nsduLength, USART0);
    }
}
#endif
